In [1]:
import pandas as pd

#  Data Cleaning & Wrangling with pandas

In [3]:
# collect data 
url_link = "https://en.wikipedia.org/wiki/List_of_largest_companies_by_revenue"
import pandas as pd

In [4]:
df = pd.read_html(url_link)

#convert to df by indexing the first row
df = df[0]
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

,Ranks,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.
,Ranks,Name,Industry,USD (in millions),USD (in millions),Employees,Headquarters[note 1],State-owned,Ref.
0,1,Walmart,Retail,"$680,985","$19,436",2100000,United States,NaN,[1]
1,2,Amazon,Retail information technology,"$637,959","$59,248",1556000,United States,NaN,[4]
2,3,State Grid Corporation of China,Electricity,"$545,948","$9,204",1361423,China,NaN,[5]
3,4,Saudi Aramco,Oil and gas,"$480,446","$106,246",73311,Saudi Arabia,NaN,[6]
4,5,China Petrochemical Corporation,Oil and gas,"$429,700","$9,393",513434,China,NaN,[7]

#### cleaning goals
- remove double heading(multiindex) to singleindex: google search 
- drop unnecessary column
- check for duplicates
- check and remove nulls

##### explore  data 
- df.tail()
- df.shape 
- df.info()
- df.unique(): to check for inconsistencies

In [8]:
df.columns

MultiIndex([(               'Ranks',                'Ranks'),
            (                'Name',                 'Name'),
            (            'Industry',             'Industry'),
            (             'Revenue',    'USD (in millions)'),
            (              'Profit',    'USD (in millions)'),
            (           'Employees',            'Employees'),
            ('Headquarters[note 1]', 'Headquarters[note 1]'),
            (         'State-owned',          'State-owned'),
            (                'Ref.',                 'Ref.')],
           )

In [9]:
# convert multiindex column to single index collumn
df.columns = df.columns.get_level_values(0)
df.head(2)

,Ranks,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.
0,1,Walmart,Retail,"$680,985","$19,436",2100000,United States,NaN,[1]
1,2,Amazon,Retail information technology,"$637,959","$59,248",1556000,United States,NaN,[4]

In [10]:
# delette unnecessary columns
df.drop(['Ref.'], axis=1, inplace=True)

In [11]:
df.drop(['State-owned'], axis=1, inplace=True)
df.head()

,Ranks,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1]
0,1,Walmart,Retail,"$680,985","$19,436",2100000,United States
1,2,Amazon,Retail information technology,"$637,959","$59,248",1556000,United States
2,3,State Grid Corporation of China,Electricity,"$545,948","$9,204",1361423,China
3,4,Saudi Aramco,Oil and gas,"$480,446","$106,246",73311,Saudi Arabia
4,5,China Petrochemical Corporation,Oil and gas,"$429,700","$9,393",513434,China

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Ranks                 49 non-null     int64
 1   Name                  49 non-null     object
 2   Industry              49 non-null     object
 3   Revenue               49 non-null     object
 4   Profit                49 non-null     object
 5   Employees             49 non-null     int64
 6   Headquarters[note 1]  49 non-null     object
dtypes: int64(2), object(5)
memory usage: 2.8+ KB

- no missing info(nulls)
- revenue and profit should be int. not objects

- No duplicates

In [22]:
df.head(2)

,Ranks,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1]
0,1,Walmart,Retail,"$680,985","$19,436",2100000,United States
1,2,Amazon,Retail information technology,"$637,959","$59,248",1556000,United States

In [24]:
# Rename columns 
df.rename(columns=
         {
          'Rank': 'Ranking',
          'Name': 'CompanyName',
          'Headquarters[note 1]': 'Headquaters',
          'Employees': 'EmployeeNumber'
         }, inplace=True
         )
df.head(2)

,Ranking,CompanyName,Industry,Revenue,Profit,EmployeeNumber,Headquaters
0,1,Walmart,Retail,"$680,985","$19,436",2100000,United States
1,2,Amazon,Retail information technology,"$637,959","$59,248",1556000,United States

In [25]:
# conert Rev. column to float 
df['Revenue'].head(2)

0    $680,985
1    $637,959
Name: Revenue, dtype: object

In [26]:
# remove the $ sign from Rev column 
df['Revenue'] = df['Revenue'].str.replace('$', '') #rlace with nothing 
df['Revenue'].head(2)

0    680,985
1    637,959
Name: Revenue, dtype: object

In [27]:
# remove the $ sign from profit column 
df['Profit'] = df['Profit'].str.replace('$', '') #rlace with nothing 
df['Profit'].head(2)

0    19,436
1    59,248
Name: Profit, dtype: object

In [28]:
# remove the (,) from the Rev
df['Revenue'] = df['Revenue'].str.replace(',', '') #relace with nothing 
df['Revenue'].head(2)

0    680985
1    637959
Name: Revenue, dtype: object

In [29]:
# remove the (,) from the profit
df['Profit'] = df['Profit'].str.replace(',', '') #relace with nothing 
df['Profit'].head(2)

0    19436
1    59248
Name: Profit, dtype: object

In [30]:
df.head()

,Ranking,CompanyName,Industry,Revenue,Profit,EmployeeNumber,Headquaters
0,1,Walmart,Retail,680985,19436,2100000,United States
1,2,Amazon,Retail information technology,637959,59248,1556000,United States
2,3,State Grid Corporation of China,Electricity,545948,9204,1361423,China
3,4,Saudi Aramco,Oil and gas,480446,106246,73311,Saudi Arabia
4,5,China Petrochemical Corporation,Oil and gas,429700,9393,513434,China

In [31]:
# rename Rev & Profit column 
df.rename(columns=
         {
          'Revenue': 'Revenue($)',
          'Profit': 'Profit($)'
         }, inplace=True
         )
df.head(2)

,Ranking,CompanyName,Industry,Revenue($),Profit($),EmployeeNumber,Headquaters
0,1,Walmart,Retail,680985,19436,2100000,United States
1,2,Amazon,Retail information technology,637959,59248,1556000,United States

In [32]:
# convert object to float 
df[['Revenue($)','Profit($)']]= df[['Revenue($)','Profit($)' ]].astype(float)
df.dtypes

Ranking             int64
CompanyName        object
Industry           object
Revenue($)        float64
Profit($)         float64
EmployeeNumber      int64
Headquaters        object
dtype: object

In [33]:
df.head()

,Ranking,CompanyName,Industry,Revenue($),Profit($),EmployeeNumber,Headquaters
0,1,Walmart,Retail,680985.0,19436.0,2100000,United States
1,2,Amazon,Retail information technology,637959.0,59248.0,1556000,United States
2,3,State Grid Corporation of China,Electricity,545948.0,9204.0,1361423,China
3,4,Saudi Aramco,Oil and gas,480446.0,106246.0,73311,Saudi Arabia
4,5,China Petrochemical Corporation,Oil and gas,429700.0,9393.0,513434,China

# Subsetting a DataFrame

In [36]:
# subset the data 
# to bring out Rev & Profit
df_subset = df.loc[[i for i in range(1,21)],['Revenue($)', 'Profit($)']]
# this will bring out the first 20 rows of the Rev and Profit column 
df_subset.head()

   Revenue($)  Profit($)
1    637959.0    59248.0
2    545948.0     9204.0
3    480446.0   106246.0
4    429700.0     9393.0
5    476000.0    25250.0

In [37]:
# summary statistics: shows the mean(avg), median(50%) & the distribution of the data
df_subset.describe()

          Revenue($)      Profit($)
count      20.000000      20.000000
mean   374037.050000   37000.750000
std     99667.859128   37290.643909
min    244280.000000    1745.000000
25%    318327.750000    8989.000000
50%    349213.000000   18652.000000
75%    407633.500000   66470.000000
max    637959.000000  106246.000000

## Filtering

In [39]:
df.head()

,Ranking,CompanyName,Industry,Revenue($),Profit($),EmployeeNumber,Headquaters
0,1,Walmart,Retail,680985.0,19436.0,2100000,United States
1,2,Amazon,Retail information technology,637959.0,59248.0,1556000,United States
2,3,State Grid Corporation of China,Electricity,545948.0,9204.0,1361423,China
3,4,Saudi Aramco,Oil and gas,480446.0,106246.0,73311,Saudi Arabia
4,5,China Petrochemical Corporation,Oil and gas,429700.0,9393.0,513434,China

In [40]:
# to check the minimum & max no of employees 
df['EmployeeNumber'].min()
df['EmployeeNumber'].max()

2100000